# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "devopsdays/tap"
tap "sachaos/todoist"

# Brew CLI apps
brew "atuin"
brew "chezmoi"
brew "gh"
brew "fish"
brew "eza"
brew "git-extras"
brew "gnupg"
brew "go"
brew "glow"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "uv"
brew "git-cal"
brew "mas"
brew "neovim"
brew "node"
brew "thefuck"
brew "tree"
brew "vim"
brew "wget"
brew "pnpm"
brew "llm"
brew "yarn"
brew "fzf"
brew "bat"
brew "fd"
brew "ripgrep"
brew "bfg"
brew "todoist"
brew "pyenv"
brew "ollama"
brew "z"
brew "lux"
brew "btop"
brew "poetry"
brew "tmux"


# App casks
cask "stats"
cask "1password"
cask "cursor"
cask "nordvpn"
cask "1password-cli"
cask "alacritty"
cask "discord"
cask "docker"
cask 'flux'
cask "ngrok"
cask "notion"
cask "maccy"
cask "karabiner-elements"
cask "obsidian"
cask "postman"
cask "keepingyouawake"
cask "signal"
cask "slack"
cask "rectangle"
cask "zoom"
cask "raycast"
cask "google-chrome"

# Font casks
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"

# Mac App Store apps
mas "Spark Classic – Email App", id: 1176895641
mas "Todoist: To-Do List & Tasks", id: 585829637
